Installing the SQL libraries to the google collab notebook

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.8 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

Loading the SQL extension

In [2]:
%load_ext sql

Creating the database ABC_DATA

In [3]:
%%sql
sqlite:///ABC_DATA.db

Creating the Customers table

In [4]:
%%sql
CREATE TABLE  Customers(
    Customer_Id Integer PRIMARY KEY,
    FirstName VARCHAR(100),
    SecondName VARCHAR(100),
    Email VARCHAR(100)
);

 * sqlite:///ABC_DATA.db
Done.

[]

Confirming if we have the table

In [5]:
%%sql
SELECT * FROM Customers

 * sqlite:///ABC_DATA.db
Done.

[]

Creating the Products Table

In [6]:
%%sql
CREATE TABLE Products(
    Product_Id Integer PRIMARY KEY,
    ProductName VARCHAR(100),
    Price Integer
)

 * sqlite:///ABC_DATA.db
Done.

[]

In [7]:
%%sql
SELECT * FROM Products

 * sqlite:///ABC_DATA.db
Done.

[]

Creating the Orders Table

In [8]:
%%sql
CREATE TABLE Orders(
    Order_Id Integer PRIMARY KEY,
    Customer_Id Integer,
    Order_Date date
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [9]:
%%sql
SELECT * FROM Orders

 * sqlite:///ABC_DATA.db
Done.

[]

Creating the Order_Items Table

In [10]:
%%sql
CREATE TABLE Order_Items(
    Order_id Integer,
    Product_Id Integer,
    Quantity Integer
)

 * sqlite:///ABC_DATA.db
Done.

[]

In [11]:
%%sql
SELECT * FROM Order_Items

 * sqlite:///ABC_DATA.db
Done.

[]

Inserting Into the Customer Table

In [12]:
%%sql
INSERT INTO Customers (customer_Id, FirstName, SecondName, Email) VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [13]:
%%sql
SELECT * FROM Customers

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

Inserting Into the Products Table

In [14]:
%%sql
INSERT INTO Products (Product_Id, ProductName, Price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [15]:
%%sql
SELECT * FROM Products

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 10),
 (2, 'Product B', 15),
 (3, 'Product C', 20),
 (4, 'Product D', 25),
 (5, 'Product E', 30),
 (6, 'Product F', 35),
 (7, 'Product G', 40),
 (8, 'Product H', 45),
 (9, 'Product I', 50),
 (10, 'Product J', 55),
 (11, 'Product K', 60),
 (12, 'Product L', 65),
 (13, 'Product M', 70)]

Inserting into the orders table

In [16]:
%%sql
INSERT INTO Orders (Order_Id, Customer_Id, Order_Date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [17]:
%%sql
SELECT * FROM Orders

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

Inserting Into the Order_Items Table

In [18]:
%%sql
INSERT INTO Order_Items (Order_id, Product_Id, Quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///ABC_DATA.db
32 rows affected.

[]

In [19]:
%%sql
Select * FROM Order_Items

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

**1**.Which product has the highest price? Only return a single row.

In [20]:
%%sql
SELECT * FROM PRODUCTS
  ORDER BY Price DESC
  limit 1;

 * sqlite:///ABC_DATA.db
Done.

[(13, 'Product M', 70)]

**Answer:**  Product M has the highest Price with a price of 70

**2.** Which order_id had the highest number of items in terms of quantity

In [21]:
%%sql
SELECT * FROM Order_Items
ORDER BY QUANTITY DESC;

 * sqlite:///ABC_DATA.db
Done.

[(4, 2, 4),
 (2, 3, 3),
 (6, 2, 3),
 (8, 6, 3),
 (10, 10, 3),
 (11, 13, 3),
 (13, 6, 3),
 (15, 10, 3),
 (16, 13, 3),
 (1, 1, 2),
 (3, 3, 2),
 (5, 3, 2),
 (7, 5, 2),
 (9, 8, 2),
 (10, 11, 2),
 (12, 4, 2),
 (13, 7, 2),
 (14, 9, 2),
 (16, 12, 2),
 (1, 2, 1),
 (2, 2, 1),
 (3, 1, 1),
 (4, 3, 1),
 (5, 1, 1),
 (6, 1, 1),
 (7, 4, 1),
 (8, 7, 1),
 (9, 9, 1),
 (11, 12, 1),
 (12, 5, 1),
 (14, 8, 1),
 (15, 11, 1)]

**Answer: **Order_Id 4 has the highest number of Items with 4 quantities

Which customer has made the most orders?

In [22]:
%%sql
WITH Order_Counts AS (
    SELECT Customer_Id, COUNT(Customer_Id) AS Order_Count
    FROM Orders
    GROUP BY Customer_Id
),
Max_Order_Counts AS (
    SELECT MAX(Order_Count) AS Max_Count
    FROM Order_Counts
)
SELECT c.FirstName, c.SecondName
FROM Customers c
JOIN Order_Counts oc ON c.Customer_Id = oc.Customer_Id
JOIN Max_Order_Counts moc ON oc.Order_Count = moc.Max_Count;

 * sqlite:///ABC_DATA.db
Done.

[('John', 'Doe'), ('Jane', 'Smith'), ('Bob', 'Johnson')]

What’s the total revenue per product?

In [23]:
%%sql
SELECT p.Product_Id, p.ProductName, p.Price * SUM(oi.Quantity) AS Total_Revenue
FROM Products p
JOIN Order_Items oi ON p.Product_Id = oi.Product_Id
GROUP BY P.ProductName

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 50),
 (2, 'Product B', 135),
 (3, 'Product C', 160),
 (4, 'Product D', 75),
 (5, 'Product E', 90),
 (6, 'Product F', 210),
 (7, 'Product G', 120),
 (8, 'Product H', 135),
 (9, 'Product I', 150),
 (10, 'Product J', 330),
 (11, 'Product K', 180),
 (12, 'Product L', 195),
 (13, 'Product M', 420)]

# DAY 5 **CHALLENGE**

1.Find the first order (by date) for each customer.
**bold text**

In [47]:
%%sql
WITH FirstOrderDates AS (
    SELECT
        customer_id,
        MIN(order_date) AS first_order_date
      FROM
        orders
      GROUP BY
        customer_id
)
    SELECT
        O.customer_id,
        O.order_id,
        O.order_date,
        C.FirstName,
        C.SecondName
    FROM orders O
    JOIN FirstOrderDates fod
    ON o.customer_id = fod.customer_id
    JOIN customers C
      ON o.customer_id = c.customer_id
  AND o.order_date = fod.first_order_date;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01', 'John', 'Doe'),
 (2, 2, '2023-05-02', 'Jane', 'Smith'),
 (3, 3, '2023-05-03', 'Bob', 'Johnson'),
 (4, 7, '2023-05-07', 'Alice', 'Brown'),
 (5, 8, '2023-05-08', 'Charlie', 'Davis'),
 (6, 9, '2023-05-09', 'Eva', 'Fisher'),
 (7, 10, '2023-05-10', 'George', 'Harris'),
 (8, 11, '2023-05-11', 'Ivy', 'Jones'),
 (9, 12, '2023-05-12', 'Kevin', 'Miller'),
 (10, 13, '2023-05-13', 'Lily', 'Nelson'),
 (11, 14, '2023-05-14', 'Oliver', 'Patterson'),
 (12, 15, '2023-05-15', 'Quinn', 'Roberts'),
 (13, 16, '2023-05-16', 'Sophia', 'Thomas')]

2. Whats the total revenue per product

In [26]:
%%sql
SELECT p.Product_Id, p.ProductName, p.Price * SUM(oi.Quantity) AS Total_Revenue
FROM Products p
JOIN Order_Items oi ON p.Product_Id = oi.Product_Id
GROUP BY P.ProductName

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 50),
 (2, 'Product B', 135),
 (3, 'Product C', 160),
 (4, 'Product D', 75),
 (5, 'Product E', 90),
 (6, 'Product F', 210),
 (7, 'Product G', 120),
 (8, 'Product H', 135),
 (9, 'Product I', 150),
 (10, 'Product J', 330),
 (11, 'Product K', 180),
 (12, 'Product L', 195),
 (13, 'Product M', 420)]

3.Find the day with the highest revenue.

In [40]:
%%sql
SELECT
  DATE(o.order_date) AS order_day,
  p.Price * SUM(oi.Quantity) AS Daily_Revenue
FROM
  orders o
JOIN Products p ON p.Product_Id = o.order_Id
JOIN Order_Items oi ON p.Product_Id = oi.Product_Id
GROUP BY
  DATE(o.order_date)
ORDER BY Daily_Revenue DESC

 * sqlite:///ABC_DATA.db
Done.

[('2023-05-13', 420),
 ('2023-05-10', 330),
 ('2023-05-06', 210),
 ('2023-05-12', 195),
 ('2023-05-11', 180),
 ('2023-05-03', 160),
 ('2023-05-09', 150),
 ('2023-05-08', 135),
 ('2023-05-02', 135),
 ('2023-05-07', 120),
 ('2023-05-05', 90),
 ('2023-05-04', 75),
 ('2023-05-01', 50)]